[{"id":0,"title":"Registration","abstract":"Please arrive early to register, once registered you can mingle and get ready for the keynote.","speakers":[],"begins":"2014-06-09T08:00:00.0000000-04:00","ends":"2014-06-09T09:00:00.0000000-04:00","location":"Main Hall","vimeoId":""},{"id":1,"title":"Keynote","abstract":"Keynote is still being planned, rest assured it will be epic!","speakers":[],"begins":"2014-06-09T09:00:00.0000000-04:00","ends":"2014-06-09T10:00:00.0000000-04:00","location":"","vimeoId":""},{"id":2,"title":"Managed Runtimes: JIT vs AOT compilation","abstract":"There's a lot going on in managed runtime compilation nowadays. In this talk we'll look at the state of the art in both the .NET and Java world. Both from a deep technical point of view as well as practical advice on how to make trade-offs on what strategy to choose for your application.","speakers":[{"id":3,"name":"Jeroen Frijters","twitterHandle":"jeroenfrijters","bio":"Lead developer and founder of IKVM.NET an open source Java VM for .NET. CLR geek and accidental security researcher.","headshotUrl":"/images/speakers/jeroen.jpg"}],"begins":"2014-06-09T10:15:00.0000000-04:00","ends":"2014-06-09T11:15:00.0000000-04:00","location":"","vimeoId":""},{"id":3,"title":"CoZy Programming - The future?","abstract":"I want to dive into programming methodologies. Most of us are (or should be) familiar with agile, scrums and the pig/chicken roles. Is this an outdated way of looking at things? As technology evolves, more people are working remotely and I want to explore how software development practices can evolve with this. As a Xamarin developer I want to explore how the .NET and open source community can lead the way in this.","speakers":[{"id":2,"name":"Amy Burns","twitterHandle":"timeyoutakeit","bio":"I am a Documentation Developer for Xamarin - in other words I write for both humans and our robot overlords. I am relatively new to the .NET community - I graduated with a CS degree only last summer, and have been working for Xamarin since July last year. I enjoying random hacking, reading and pondering what will become of the world once robots take over.","headshotUrl":"/images/speakers/amy.jpg"}],"begins":"2014-06-09T10:15:00.0000000-04:00","ends":"2014-06-09T11:15:00.0000000-04:00","location":"","vimeoId":""},{"id":4,"title":"Let's talk Mvvm","abstract":"The last 2 years of MvvmCross have been fun... we've built apps, we've shared code, we've made a lot of friends, we've made a lot of noise, and we've seen Portable go from a bright spark to a raging fire.\n\nSo now, we're here.... June 2014... but where exactly are we, what have we learnt and where might we go next?","speakers":[{"id":21,"name":"Stuart Lodge","twitterHandle":"slodge","bio":"Stuart loves writing code. For the last 20 years, he’s been lucky enough to be paid for it too. In open source, he’s published several projects most recently including a BDD UI test automation suite for WindowsPhone and the MvvmCross application framework for modern C# apps. When not coding, he loves to try and to ski as often as he can.","headshotUrl":"/images/speakers/stuart.jpg"}],"begins":"2014-06-09T11:30:00.0000000-04:00","ends":"2014-06-09T12:30:00.0000000-04:00","location":"","vimeoId":""},{"id":5,"title":"Super charging your application development with Nancy","abstract":"Harness the power of the super-duper-happy-path to reduce the time-to-market for your applications. Join as we build a fully functional cross-platform Nancy application, while exploring a vast array of topics such as authentication, localization, custom error pages, content negotiation, application API, custom conventions, social media sign-in and much more.","speakers":[{"id":10,"name":"Andreas Håkansson","twitterHandle":"thecodejunkie","bio":"Andreas Håkansson is Senior Software Engineer based in Sweden. He is an active participant of the open-source community, both as a contributor and as the creator of projects such as Common Service Factory, MefContrib and Nancy. Andreas can be found tweeting regularly using @TheCodeJunkie.","headshotUrl":"/images/speakers/andreas.jpg"}],"begins":"2014-06-09T11:30:00.0000000-04:00","ends":"2014-06-09T12:30:00.0000000-04:00","location":"","vimeoId":""},{"id":6,"title":"Lunch","abstract":"","speakers":[],"begins":"2014-06-09T12:30:00.0000000-04:00","ends":"2014-06-09T13:30:00.0000000-04:00","location":"","vimeoId":""},{"id":7,"title":"ReactiveUI - Because Reasons","abstract":"By now you've probably dabbled with Reactive Extensions.\nYou've probably heard about this \"Functional Reactive Programming\" thing and wonder if it's relevant to you.\nYou might have even seen ReactiveUI and thought about using it in one of your apps.\n\nBut you haven't. Because reasons!\n\nIn this talk, I'll walk through the goals of ReactiveUI, how to port an existing MVVM application to it, and the tradeoffs around having asynchrony everywhere in your application. And if we get time, I'll show off some of the newer features around cross-platform development.","speakers":[{"id":27,"name":"Brendan Forster","twitterHandle":"shiftkey","bio":"Brendan is a nomadic software developer working for GitHub. He's a recovering web developer, and is back doing WPF and obsessing over pixels and performance. He's done a bunch of open source work in the past, and always enjoys talking about software over a beer or two.","headshotUrl":"/images/speakers/brendan.jpg"}],"begins":"2014-06-09T13:45:00.0000000-04:00","ends":"2014-06-09T14:45:00.0000000-04:00","location":"","vimeoId":""},{"id":8,"title":"FAKE - A cross plattform build tool","abstract":"\"FAKE - F# Make\" is an open source, cross platform build automation system. Due to its integration in F#, all benefits of the .NET Framework and functional programming can be used, including the extensive class library, powerful debuggers and integrated development environments like Visual Studio or Xamarin Studio, which provide syntax highlighting and code completion. FAKE’s syntax was designed to be succinct, typed, declarative, extensible and easy to use. In this talk you will learn to write FAKE scripts and see how you can integrate such scripts into your existing continuous integration infrastructure.","speakers":[{"id":28,"name":"Steffen Forkmann","twitterHandle":"sforkmann","bio":"Steffen Forkmann is a F# MVP and works as a Software Developer on large billing systems in Dynamics NAV and therefore has great experience in applying functional concepts to real-world applications. Steffen is a very active part in the F# open source community and works on projects like \"FAKE - F# Make\", NaturalSpec and fsharpx.","headshotUrl":"/images/speakers/steffen.jpg"}],"begins":"2014-06-09T13:45:00.0000000-04:00","ends":"2014-06-09T14:45:00.0000000-04:00","location":"","vimeoId":""},{"id":9,"title":"Oculus Rift: The VR revolution","abstract":"Oculus Rift is pulling the future of virtual reality experiences closer to our present faster than anyone would ever dare dream of. For all its apparent clunkyness, no one remains indifferent to the power of the VR experience after putting on an Oculus, and soon other VR hardware will become available from companies such as Sony. But what does that mean to you, the developer?\n\nIn this talk we will look at the current efforts to expose the Oculus C++ SDK to managed land, what tools are available and how to use C#/.NET to create a VR experience for the Oculus Rift. We'll talk about the constraints of programming for such a specialized platform and the problems that emerge when your code can literally make your user feel sick. The Kinect is another piece of hardware that quietly revolutionized the way people can interact with computers, and we'll take a look at how well Oculus and Kinect work with one another for the ultimate virtual avatar experience.","speakers":[{"id":8,"name":"Andreia Gaita","twitterHandle":"sh4na","bio":"Andreia Gaita is a C#/C++ developer and long-time open source and Mono contributor. For the past 16 years she has been involved in the development of cross-platform applications, services and libraries, embedding browser engines, creating bindings and making tools that help developers be successful at companies such as Novell, Xamarin and Unity. She hails from the sunny city of Lisbon, Portugal and currently lives in Copenhagen, working as a freelancer.","headshotUrl":"/images/speakers/andreia_gaita.jpg"}],"begins":"2014-06-09T15:00:00.0000000-04:00","ends":"2014-06-09T16:00:00.0000000-04:00","location":"","vimeoId":""},{"id":10,"title":"Porting Applications Using Mono and Wine","abstract":"While Mono offers a viable stack for cross platform development, porting existing .Net applications to alternative platforms often poses significant challenges due to legacy or other third party win32 dependencies. To overcome this obstacle a combination of Mono for Windows and Wine can be used to port the application. However, Mono is not a replacement for .Net so this approach has its limitations. This talk will go over the Mono/Wine architecture, present a case study of a real world Mono/Wine port and go over some of today's limitations and future direction.","speakers":[{"id":20,"name":"Ulrich Czekalla","twitterHandle":"uczekalla","bio":"Ulrich Czekalla has been involved with Wine since 1999 when he worked at Corel Corp. as part of the Wine team porting WordPerfect and Corel Draw to Linux. All these years later he continues his involvement with Wine as the Director of Development at CodeWeavers Inc., a company that sells a proprietary version of Wine called CrossOver and provides porting services to the Mac, Linux and Android platforms.","headshotUrl":"/images/speakers/ulrich.jpg"}],"begins":"2014-06-09T15:00:00.0000000-04:00","ends":"2014-06-09T16:00:00.0000000-04:00","location":"","vimeoId":""},{"id":11,"title":"Portable Class Libraries Inside-Out","abstract":"Portable class libraries (PCL) let you write code once and use on different platforms. Now it's possible to use PCLs with Xamarin apps and this session shows you how. You'll learn how to create PCLs and use them on different platforms. You'll also learn various strategies for integrating PCL and non-PCL code along with the pros and cons of doing so.","speakers":[{"id":9,"name":"Joe Mayo","twitterHandle":"joemayo","bio":"Joe Mayo is an author, consultant, and instructor who specializes in Microsoft and Xamarin technologies. He has been using C# since it was first announced in July 2000 and his 6 books are all on .NET topics. For his community contributions, Microsoft has honored Joe with several MVP awards over the years.","headshotUrl":"/images/speakers/joe.jpg"}],"begins":"2014-06-09T16:15:00.0000000-04:00","ends":"2014-06-09T17:15:00.0000000-04:00","location":"","vimeoId":""},{"id":12,"title":"SOA development with the new NServiceBus platform","abstract":"When we go about designing and building a scalable durable system we need to solve the number one issue in developing scalable software systems: coupling.\nImplementing Service Oriented style architecture also refereed to lately as micro-services will help you solve this problem.\nNServiceBus and the Particular Platform provides you with a set of tools to develop, debug and monitor a distributed system.\nIn this presentation we will build a distributed system and debug it in under an hour using NServiceBus and the particular platform.","speakers":[{"id":17,"name":"Sean Farmar","twitterHandle":"farmar","bio":"A SOA and NServiceBus expert, Sean Farmar is an independent consultant with over 20 years of experience in software development space.\nSean was the Lead Technical Architect in his last couple of roles, and has hands on experience in designing building and deploying distributed systems using NServiceBus, from inception to production, then scaling out and growing.\n\nCurrently Sean is helping customers succeed in adopting SOA and NServiceBus","headshotUrl":"/images/speakers/sean.jpg"}],"begins":"2014-06-09T16:15:00.0000000-04:00","ends":"2014-06-09T17:15:00.0000000-04:00","location":"","vimeoId":""},{"id":13,"title":"Designing Wonderful .NET APIs","abstract":"There are .NET libraries that are complex to setup, hard to understand, difficult to debug, and impossible to extend. And then there are .NET libraries for the same task that wonderfully just work. Why has one succeed where the other failed?\n\nIn this session James will discuss what makes a well designed API, from high level design principles like The Pit of Success, The Wall of Complexity, and The Power of Sameness, to applying those concepts in .NET class design, with the goal of creating .NET libraries that developers love to use.","speakers":[{"id":4,"name":"James Newton-King","twitterHandle":"jamesnk","bio":"James Newton-King is a software developer from Wellington, New Zealand. He works for Intergen where he spends his time building awesome web applications and making fun of SharePoint.\n\nJames is best known for creating Json.NET, one of .NET's most popular open source libraries with over 5 million downloads and used by Visual Studio, Azure, ASP.NET WebAPI, SignalR, RavenDB and hundreds of other .NET libraries.","headshotUrl":"/images/speakers/james.jpg"}],"begins":"2014-06-09T17:30:00.0000000-04:00","ends":"2014-06-09T18:30:00.0000000-04:00","location":"","vimeoId":""},{"id":14,"title":"OSS from the trenches - Tips for Maintainers & Contributors","abstract":"Maintainers and contributors are who make the OSS world go round. While it may appear that the impetus is on contributors to take the initiative, it’s important to remember that project creators and maintainers need to help pave the way.\n\nJoin Anthony van der Hoorn, co-founder and maintainer of Glimpse, an open source project used by ten of thousands of developers daily, as we dive into the maintainer/contributor relationship. We will examine what maintainers can do to help contributors easily on-ramp and join a project, as well as getting the most from those who are contributing. In addition, we will look at what contributors can do to get involved, give back to the community and benefit from your contributions.","speakers":[{"id":12,"name":"Anthony van der Hoorn","twitterHandle":"anthony_vdh","bio":"Anthony van der Hoorn is a co–founder of Glimpse, and a regular speaker on such topics as Open Source, Web Practices and Diagnostics for the Web. Anthony has specializing in web and front end development with technologies such as JavaScript, CSS, and HTML. He’s bounced between living and working New York City and his home town of Brisbane, Australia – he’s back in the USA at the moment. Anthony previously worked in the Financial Services sector developing high frequency trading systems and, in his spare time, he can be found out and about taking photos, speaking at conferences, and working on other Open Source projects.","headshotUrl":"/images/speakers/anthony.jpg"}],"begins":"2014-06-09T17:30:00.0000000-04:00","ends":"2014-06-09T18:30:00.0000000-04:00","location":"","vimeoId":""},{"id":15,"title":"The Future of .NET on the Server","abstract":"Learn about new thinking around ASP.NET and the .NET Framework. What does ASP.NET look like in 2014 and beyond? In a world of NuGet packages and modular frameworks, of lightweight VMs, how could ASP.NET change and get faster, leaner, meaner, and more?","speakers":[{"id":31,"name":"Howard Dierking","twitterHandle":"howard_dierking","bio":"Howard Dierking is a program manager on the Microsoft Azure Frameworks and Tools team where his focus is on ASP.NET, NuGet and Web APIs. Previously, he served as the editor-in-chief of MSDN Magazine, and also ran the developer certification program for Microsoft Learning. He spent 10 years prior to Microsoft as a developer and application architect with a focus on distributed systems.","headshotUrl":"/images/speakers/howard.jpg"}],"begins":"2014-06-10T09:00:00.0000000-04:00","ends":"2014-06-10T10:00:00.0000000-04:00","location":"","vimeoId":""},{"id":16,"title":"Reaching the Chinese App Market","abstract":"Jon will cover his experiences delivering Draw a Stickman: EPIC to over 30 different app stores in China. The game was originally pirated by millions of users specifically in that country, so Hitcents took on the mission to deliver a legitimate, culturalized version of the game to China. In addition to covering app store requirements, setting up automated builds, and testing, Jon will cover the changes in monetization required for a mobile game to succeed in China. China is the next up and coming app market, with the capacity to surpass the U.S. in revenue in the next few years.","speakers":[{"id":25,"name":"Jonathan Peppers","twitterHandle":"jonathanpeppers","bio":"Jon was the lead developer on the successful C# MonoGame game, Draw a Stickman: EPIC, winner of two Webby awards. The game is currently available on iOS, Android, Kindle, Windows Phone, Windows 8, Mac, and Steam. He is also the author of the book \"Xamarin Cross-platform Development\" and works on cross platform C# business applications as well as games at Hitcents.","headshotUrl":"/images/speakers/jonathan_peppers.jpg"}],"begins":"2014-06-10T09:00:00.0000000-04:00","ends":"2014-06-10T10:00:00.0000000-04:00","location":"","vimeoId":""},{"id":17,"title":"Creating Cross Platform .NET Libraries","abstract":"There are two main ways of reusing code across platforms in .NET.  You can either share the source code and create multiple binaries or use Portable Class Libraries to create a single one.  There are pros and cons to each method, and in this session we will learn how to combine both of them so that consumers of your library can get all of the benefits and none of the drawbacks!  Learn the technique that Miguel de Icaza has called it “amazing” [1] and “a godsend”! [2]  We’ll also learn some details of how PCLs work, and where we are planning to take them in the future.\n\n[1] - https://twitter.com/migueldeicaza/status/428569162542100480\n[2] - https://twitter.com/migueldeicaza/status/451024983007842304","speakers":[{"id":14,"name":"Daniel Plaisted","twitterHandle":"dsplaisted","bio":"Since joining Microsoft in 2008, Daniel has worked on the Managed Extensibility Framework (MEF), Portable Class Libraries, and the .NET Framework.  He's presented at MS TechEd, Build, and various local groups, code camps, and conferences.  In his free time, he enjoys computer games, reading, hiking, juggling, and footbagging (hackey-sack).","headshotUrl":"/images/speakers/daniel.jpg"}],"begins":"2014-06-10T10:15:00.0000000-04:00","ends":"2014-06-10T11:15:00.0000000-04:00","location":"","vimeoId":""},{"id":18,"title":"Embedding Mono for Fun and Profit","abstract":"Providing a scripting environment and language so that users can mod and extend a game is a traditional practice in the videogame industry, where game engines are usually made in C/C++, but it's not only games that can gain flexibility and power by leveraging a scripting environment. With Mono's embedding API, it's easy for any C/C++ application to add the power of C# and .NET to its arsenal.\n\nIn this talk we will go through the basics of how to embed Mono in a C/C++ application, its potential uses, as well as the problems and pitfalls that you will encounter along the way. There are many interesting things that you can do when you control the runtime, domain and assembly loader from native land, and we will look at some fun tricks that you can use to do things like a dynamic UI that you can script, extend and modify at runtime without ever restarting your app, or games where the users drive the content.","speakers":[{"id":8,"name":"Andreia Gaita","twitterHandle":"sh4na","bio":"Andreia Gaita is a C#/C++ developer and long-time open source and Mono contributor. For the past 16 years she has been involved in the development of cross-platform applications, services and libraries, embedding browser engines, creating bindings and making tools that help developers be successful at companies such as Novell, Xamarin and Unity. She hails from the sunny city of Lisbon, Portugal and currently lives in Copenhagen, working as a freelancer.","headshotUrl":"/images/speakers/andreia_gaita.jpg"}],"begins":"2014-06-10T10:15:00.0000000-04:00","ends":"2014-06-10T11:15:00.0000000-04:00","location":"","vimeoId":""},{"id":19,"title":"Writing mobile apps the GitHub Way","abstract":"Over the last three years, the Desktop Team at GitHub has converged on a new\napproach to writing desktop and mobile software, centered around the paradigm\nof Functional Reactive Programming. We've refined this through several Open\nSource libraries that are designed to combine together like Tea and Crumpets.\n\nFor C# developers, I've created a project that includes many of the libraries\nand patterns we use in the Windows version of GitHub Desktop,\n'Starter-Mobile'. We'll learn a bit about the pieces of how it works, then\ncreate a simple app with it. We'll see how the this approach leads to\ntestable, cross-platform code.","speakers":[{"id":1,"name":"Paul Betts","twitterHandle":"paulcbetts","bio":"I'm a Windows / .NET Hacker for GitHub who graduated from The Ohio State University. In my spare time, I hack on some open-source software, play guitar and bass, and in general am within ε of really awesome.","headshotUrl":"/images/speakers/paul.jpg"}],"begins":"2014-06-10T11:30:00.0000000-04:00","ends":"2014-06-10T12:30:00.0000000-04:00","location":"","vimeoId":""},{"id":20,"title":"ElasticSearch - Distributed search on BigData made easy","abstract":"ElasticSearch is a cloud-ready, super scalable search engine which is gaining a lot of popularity. It is mostly known for being extremely easy to setup and integrate with any technology stack.\n\nIn this talk we will introduce ElasticSearch, and start by looking at some of its basic capabilities. We will demonstrate how it can be used for document search and even log  analytics, and peek into more advanced usages like the various faceting options and percolation. Obviously, we will make sure to demonstrate how ElasticSearch can be scaled out easily to work on a distributed architecture and handle pretty much any load.","speakers":[{"id":15,"name":"Itamar Syn-Hershko","twitterHandle":"synhershko","bio":"Itamar is a search technologies, distributed systems and architecture expert.\n\nApache Lucene.NET committer, Elasticsearch savant, and the author of RavenDB in Action, Itamar is a frequent speaker at international conferences and provide on-site training and consultancy services around the world.","headshotUrl":"/images/speakers/itamar.jpg"}],"begins":"2014-06-10T11:30:00.0000000-04:00","ends":"2014-06-10T12:30:00.0000000-04:00","location":"","vimeoId":""},{"id":21,"title":"Lunch","abstract":"","speakers":[],"begins":"2014-06-10T12:30:00.0000000-04:00","ends":"2014-06-10T13:30:00.0000000-04:00","location":"","vimeoId":""},{"id":22,"title":"Perfecting Animations: Lessons from the Magic Kingdom","abstract":"Mobile development brought a radical shift in our ways to design UIs. Instead of thinking in terms of static text and dialog boxes, we are now exploring rich data experiences where we strive to instill life into our content.\n\nThis research for life-like behavior is partially expressed on every existing mobile platforms using animations to bring a sense of movement to every things on the user screen.\n\nFunny thing is, someone else down in Hollywood was trying to do the same thing back in the 30s with a certain well-known mouse. We will see what we can learn from him and his magical kingdom.","speakers":[{"id":6,"name":"Jérémie Laval","twitterHandle":"jeremie_laval","bio":"French guy, Xamarin hacker, I have been in the Mono scene for a long time, working on the various open-source part of the project. These days, I'm working on improving the developer experience for Xamarin.iOS and Xamarin.Android.","headshotUrl":"/images/speakers/jeremie.jpg"}],"begins":"2014-06-10T13:45:00.0000000-04:00","ends":"2014-06-10T14:45:00.0000000-04:00","location":"","vimeoId":""},{"id":23,"title":"Cheap and Easy Cloud Data APIs Using JSON-LD","abstract":"The Semantic Web community has spent over a decade developing powerful tools for publishing and interacting with web-scale data as collections of hyperlinked resources ([Linked Data][1]).\n\nMeanwhile, a price war among the major cloud providers is driving cloud storage prices to unprecedented lows, and the W3C has ratified a standard, [JSON-LD][2], which enables run-of-the-mill JSON APIs to be transparently annotated in such a way that they become first-class participants in the web of Linked Data. Even as a fledgling standard, JSON-LD is finding good uptake by projects even as big as [Gmail][3].\n\nIn the upcoming NuGet API v3, JSON-LD has enabled us to migrate our package metadata catalog from a conventional relational data store to a set of Linked Data blobs that can be statically served from the cloud at a fraction of the cost of operating an equivalent database server (SQL, NoSQL, or otherwise).\n\nIn this talk, we’ll give an overview of the entirely open source data processing pipeline that the NuGet team has developed to enable our transition to a JSON-LD-based Linked Data API. We’ll show you how we build and update the blob store when new facts (package adds, updates, deletes) enter the system, and we’ll tour some of the open source components that we have used to assemble our data pipeline ([JSON-LD.NET][4], [dotNetRDF][5]).\n\nYou do not need to have a background in Semantic Web or Linked Data concepts to understand this talk—we’ll explain the important parts as we go.\n\nlinkeddata.org \n json-ld.org \n googleappsdeveloper.blogspot.com/2013/05/introducing-actions-in-inbox-powered-by.html \n github.com/NuGet/JSON-LD.NET \n www.dotnetrdf.org/","speakers":[{"id":23,"name":"Scott Blomquist","twitterHandle":"sblom","bio":"Scott Blomquist is a full-time open source developer at Microsoft. He's currently on the NuGet team, and previously was at Microsoft Open Technologies where he worked on the Node.js core team and also authored Microsoft's first-ever contribution to the Chromium browser project. He loves making disparate technologies play nicely together, and wants to someday live in a treehouse, so long as it has broadband.","headshotUrl":"/images/speakers/scott_blomquist.jpg"}],"begins":"2014-06-10T13:45:00.0000000-04:00","ends":"2014-06-10T14:45:00.0000000-04:00","location":"","vimeoId":""},{"id":24,"title":"The Present and Future of .NET in a World of Devices and Services","abstract":"Come see an end-to-end view of the .NET platform in the new world of devices powered by cloud services. In this session you will see the present and the future of .NET in key areas such as the runtime, compiler and language foundation as well as the latest innovations for creating native applications in Windows, Azure services and cross-device experiences.","speakers":[{"id":30,"name":"Jay Schmelzer","twitterHandle":"jayschmelzer","bio":"Jay Schmelzer is a Director of Program Management on the Visual Studio Team at Microsoft.  Jay and his team are responsible for the Visual Studio design-time tools and runtime components used to build line of business and cloud applications. That includes the Visual Studio support for building Microsoft Office, Microsoft SharePoint and Windows Azure solutions, Visual Studio LightSwitch, Microsoft's managed languages (VB.NET, C# and F#) as well as the CLR and .NET Framework.","headshotUrl":"/images/speakers/jay.jpg"}],"begins":"2014-06-10T15:00:00.0000000-04:00","ends":"2014-06-10T16:00:00.0000000-04:00","location":"","vimeoId":""},{"id":25,"title":"NuGet Cross-Package Development","abstract":"With wide adoption by the .net community, NuGet has brought package management parity to .net when compared to Node Package Manager, Ruby Gems and Python pip. As organizations strive to create modular, reusable components as individual packages, more teams are using NuGet not just to consume third-party packages, but to author packages as well. But what happens when you want to add a feature or fix a bug in one of your shared packages and test it out locally with a project that depends on it?\n\nGem, npm and pip all have ways of installing packages in development mode or editable mode. How can we do something similar with NuGet?\n\nIn this talk I will introduce SlimJim, a power tool for creating Visual Studio or Xamarin Studio configurations that let you work on all the projects you're interested in within a single session. SlimJim can streamline your daily workflow, cutting out repetitive tasks and getting out of the way so you can write code.","speakers":[{"id":24,"name":"Chris Eldredge","twitterHandle":"creldredge","bio":"Chris Eldredge is a software developer for The Motley Fool who loves build tools , open source and Guinness.","headshotUrl":"/images/speakers/chris_eldredge.jpg"}],"begins":"2014-06-10T15:00:00.0000000-04:00","ends":"2014-06-10T16:00:00.0000000-04:00","location":"","vimeoId":""},{"id":26,"title":"The Future of C#","abstract":"Project Roslyn is a complete renewal of the C# and Visual Basic compilers, exposing them as full fidelity APIs for everyone to use, and providing a great foundation for evolving the tool experience and the languages themselves. And now it’s Open Source!  How can you make use of Roslyn, and what new language features do we have in store? Come and see!","speakers":[{"id":13,"name":"Dustin Campbell","twitterHandle":"dcampbell","bio":"Dustin Campbell is a principal program manager on the Visual Studio team, where he works on the Visual Basic and C# language service experiences. Currently, he is focused on the future of Visual Basic and C# in the .NET Compiler Platform (\"Roslyn\"). Before joining Microsoft, he developed much of the low-level plumbing of the award-winning CodeRush and Refactor! products at DevExpress. A regular speaker, Dustin is a noted authority in many advanced areas of the Microsoft .NET Framework and dives deep \"under the hood\" of any technology that he works with.\n\nDustin is a programming language nut. His favorite color is blue.","headshotUrl":"/images/speakers/dustin.jpg"}],"begins":"2014-06-10T16:15:00.0000000-04:00","ends":"2014-06-10T17:15:00.0000000-04:00","location":"","vimeoId":""},{"id":27,"title":"How we built Mural.ly: Building Real World Applications with Xamarin & C#","abstract":"We're are Mural.ly, a flexible online wall that help you digitize your research and ideation. It allows  remote teams to collaborate visually as if they were together. It’s being used by more than 350,000 users in 191 countries.\n\nThroughout our talk we're going to share the top lessons learnt while building our Mural.ly for iPad (currently in beta). From Memory Testing, ReactiveUI, C# async usage and build automation.\n\nWe want to share, what worked, what didn't work, and what to consider when building a new application.","speakers":[{"id":26,"name":"Johnny G Halife","twitterHandle":"johnnyhalife","bio":"Chief Architect from Mural.ly, I've worked in a wide-variety of projects. Prior starting with Mural.ly, I was a Partner Architect from a Software Company, and I got to design and build on things like Powershell Web Access for Windows 8 OS, training material and many enterprise projects.\n\nYou can read more about me on my blog http://johnny.io or checkout my projects at http://github.com/johnnyhalife or http://github.com/tactivos\n\n","headshotUrl":"/images/speakers/johnny_halife.jpg"}],"begins":"2014-06-10T16:15:00.0000000-04:00","ends":"2014-06-10T17:15:00.0000000-04:00","location":"","vimeoId":""},{"id":28,"title":"On the edge of .NET and Node.js","abstract":"This talk will show you how to script Node.js from .NET and call into .NET from Node.js using Edge.js. You can use Edge.js on Windows with CLR as well as on MacOS or Linux with Mono. Learn how to combine the power of 70,000+ Node.js modules with .NET Framework and 20,000+ NuGet packages within a single process.Every framework or language has unique strengths.\n\nTraditionally the choice of the development environment was made at the level of the entire application. With Edge.js you can combine Node.js and .NET/Mono within a single process, and choose the best framework for a particular task. It is powerful, convenient, and fast.","speakers":[{"id":11,"name":"Tomasz Janczuk","twitterHandle":"tjanczuk","bio":"I have worked for 12 years at Microsoft, writing .NET Framework code as well as code in .NET Framework. While at Microsoft I have also spent a lot of time working on the Node.js story for Windows and Windows Azure. I have created the https://github.com/tjanczuk/iisnode project for hosting Node.js applications in IIS on Windows which today powers Node.js applications in Windows Azure Web Sites and Windows Azure Mobile Services. In my free time I have played with Node.js and .NET interoperability which resulted in the Edge.js project (http://tjanczuk.github.io/edge/).\n\nAfter Microsoft I spent some time on a startuptical (https://mobilechapters.com). When the startup did what startups do, I took my learnings and joined Hewlett-Packard to help with OpenStack development.\n\nI live in the Pacific Northwest and enjoy every drop of the rain.","headshotUrl":"/images/speakers/tomasz.jpg"}],"begins":"2014-06-10T17:30:00.0000000-04:00","ends":"2014-06-10T18:30:00.0000000-04:00","location":"","vimeoId":""},{"id":29,"title":"Maximizing code sharing across platforms","abstract":"A strong point of the Xamarin SDK is that it allows code to be shared across platforms. From architecture to libraries, let's explore some ways to maximize code reuse.","speakers":[{"id":29,"name":"Alexandra Marin","twitterHandle":"xmonodev","bio":"I like kittens, mobile & rock'n'roll.","headshotUrl":"/images/speakers/alexandra.jpg"}],"begins":"2014-06-10T17:30:00.0000000-04:00","ends":"2014-06-10T18:30:00.0000000-04:00","location":"","vimeoId":""},{"id":30,"title":"Serialize All The Things with Json.NET","abstract":"Json.NET is a popular open source library for working with JSON. Used by Visual Studio, Azure, ASP.NET WebAPI, SignalR, RavenDB, hundreds of other .NET libraries or just directly in your own application, Json.NET is easy to use but hard to master, with dozens of features to help you when building web applications.\n\nIn this session James, Json.NET's author, will show you how to harness Json.NET's advanced features to optimize JSON size, improve performance, reduce code and save your time.","speakers":[{"id":4,"name":"James Newton-King","twitterHandle":"jamesnk","bio":"James Newton-King is a software developer from Wellington, New Zealand. He works for Intergen where he spends his time building awesome web applications and making fun of SharePoint.\n\nJames is best known for creating Json.NET, one of .NET's most popular open source libraries with over 5 million downloads and used by Visual Studio, Azure, ASP.NET WebAPI, SignalR, RavenDB and hundreds of other .NET libraries.","headshotUrl":"/images/speakers/james.jpg"}],"begins":"2014-06-11T09:00:00.0000000-04:00","ends":"2014-06-11T10:00:00.0000000-04:00","location":"","vimeoId":""},{"id":31,"title":"Immutability, State and Scale - Functional, Distributed Applications in Azure","abstract":"Traditional approaches to build cloud applications have been very successful, but as we reach the performance limits of computing, perhaps a functional approach will yield the next quantum leap in designing and building high performance distributed applications.\n\nIn this talk, we will take a traditional problem - building an accounting system - and develop a radically new functional architecture suited especially for Azure. We will apply functional concepts such as value semantics, and immutability to the Azure environment and develop techniques for super-scalable, functional workflows.","speakers":[{"id":16,"name":"Mahesh Krishnan","twitterHandle":"maheshkrishnan","bio":"Mahesh Krishnan works as a Principal Consultant at Readify in Melbourne, Australia. He is a Windows Azure MVP, has written a couple of books, and speaks regularly at conferences. He is active in the local .NET community in Melbourne, and is constantly organising code camps and other events such as the conference Developer Developer Developer over there.","headshotUrl":"/images/speakers/mahesh.jpg"}],"begins":"2014-06-11T09:00:00.0000000-04:00","ends":"2014-06-11T10:00:00.0000000-04:00","location":"","vimeoId":""},{"id":32,"title":"Modularity in .Net Architectures","abstract":"While the mainstream .Net web frameworks haven't historically been paragons of modular architecture, it's certainly possible and definitely desirable to create highly modular frameworks in .Net.  In this talk I'll do a deep dive on how my company is able to build vertical features in completely separate repositories and teams without changing the core application.  We'll take a hard look at using the \"Russian Doll\" model to compose both HTTP pipelines and message bus handlers to reduce repetitive code and share cross cutting code.  Lastly, I'll discuss what I see as the challenges ahead for maximizing the value of our new OWIN-enabled web stack in .Net.","speakers":[{"id":5,"name":"Jeremy Miller","twitterHandle":"jeremydmiller","bio":"Jeremy is the Director of Software Architecture at Extend Health. Jeremy began his software career writing \"Shadow IT\" applications to automate his engineering documentation, then wandered into software development because it looked like more fun.  Jeremy is the author of StructureMap and the technical leader of the FubuMVC community.","headshotUrl":"/images/speakers/jeremy.jpg"}],"begins":"2014-06-11T10:15:00.0000000-04:00","ends":"2014-06-11T11:15:00.0000000-04:00","location":"","vimeoId":""},{"id":33,"title":"Building Location-Aware Apps with iBeacons","abstract":"An app's ability to use a device's location to deliver an enhanced experience has always been a powerful tool, and iBeacons are taking that to a whole new level. iBeacons are low-powered transmitters that broadcast their presence to devices in the area using Bluetooth Low Energy. Developers can use these broadcasts to deliver a context-aware experience in their apps in ways that were simply not possible before, directly based on the user's proximity to specific beacons. This is already being put to use in retail stores and MLB ballparks, and the list of other possibilities is endless.\n\nIn this session we'll go over what iBeacons are, how they work, and how to use them to write location-aware apps for both iOS and Android.","speakers":[{"id":7,"name":"Greg Shackles","twitterHandle":"gshackles","bio":"Greg Shackles is a Senior Software Engineer at Olo. He is a Xamarin MVP, host of the Gone Mobile podcast, organizer of the NYC Mobile .NET Developers Group, author of Mobile Development with C# and also a monthly Visual Studio Magazine column. Outside of technology, Greg is obsessed with heavy metal, baseball, and craft beer, sometimes in combination, and is also an aspiring homebrewer.","headshotUrl":"/images/speakers/greg.jpg"}],"begins":"2014-06-11T10:15:00.0000000-04:00","ends":"2014-06-11T11:15:00.0000000-04:00","location":"","vimeoId":""},{"id":34,"title":"Cross-Platforming Everything with Splat and Friends","abstract":"Portable Class Libraries are the New Hotness to write one library and use it\neverywhere. But if you've ever tried to actually *do* that, you find out that\nit's not as quite as straightforward as you planned. Bitmaps? Caching? UI\nframeworks can't even agree on how to implement Colors! Should we just give up\nand write the same code over and over?\n\nNo! Come to this talk and see strategies for sharing code on every platform,\nfrom your iPhone to your Microsoft Surface, using a few open-source libraries\nto help us share way more code than we thought we could. We'll go over tips,\ntricks, and patterns proven to work on every platform.","speakers":[{"id":1,"name":"Paul Betts","twitterHandle":"paulcbetts","bio":"I'm a Windows / .NET Hacker for GitHub who graduated from The Ohio State University. In my spare time, I hack on some open-source software, play guitar and bass, and in general am within ε of really awesome.","headshotUrl":"/images/speakers/paul.jpg"}],"begins":"2014-06-11T11:30:00.0000000-04:00","ends":"2014-06-11T12:30:00.0000000-04:00","location":"","vimeoId":""},{"id":35,"title":"What happen when I run my app? the first milliseconds...","abstract":"You are a developer, you know your libraries, you know your language, you probably know your Operating System very well, but... Have you wondered what happen every time an application loads? what happen when you click in that icon and wait for your app to start? What is all that work involved in make your application \"load\" and then \"run\"?\n\nLike the first milliseconds before the big bang some of those questions still a mystery (or are they?). I will try to help you understand and learn about the loading process and all the hard work done by your operating system before you can even see your application running... This talk won't only cover Windows/MacOSX but it will be even applicable to other platforms... Beware, a lot of unicorns and cats will be shown!","speakers":[{"id":18,"name":"Cristian Prieto","twitterHandle":"cprieto","bio":"Cristian is a Senior Consultant working for Readify in Melbourne, Australia. In more than 13 years he has coded in so many different platforms that until now for him is very difficult to even explain to his mom what he do for living. He is a a known speaker in the .NET circles of Melbourne and when he is not learning or playing with code he could be found reading about history and over all, the impact of cats in internet history.","headshotUrl":"/images/speakers/cristian.jpg"}],"begins":"2014-06-11T11:30:00.0000000-04:00","ends":"2014-06-11T12:30:00.0000000-04:00","location":"","vimeoId":""},{"id":36,"title":"Lunch","abstract":"","speakers":[],"begins":"2014-06-11T12:30:00.0000000-04:00","ends":"2014-06-11T13:30:00.0000000-04:00","location":"","vimeoId":""},{"id":37,"title":"F# in Social Gaming","abstract":"Over the past couple of years we have seen F# gradually being adopted across the software industry. Whilst that adoption has been largely centred around the financial industry, F# on its own is an incredibly versatile and expressive language and enables you to solve a wide array of problems succinctly and efficiently.\n\nThis talk illustrates, with real examples, how the GameSys social team is using F# to build the backend services that supports around 1 million Daily Active Users (DAU) across its social games on both mobile and web platforms.","speakers":[{"id":19,"name":"Yan Cui","twitterHandle":"theburningmonk","bio":"Yan Cui works as a server side developer at Gamesys where he develops scalable backend services for Gamesys's social games on mobile and Facebook. He is a regular speaker, blogger, open source author and co-author of the upcoming book \"F# Deep Dives\" by Mannings.","headshotUrl":"/images/speakers/yan.jpg"}],"begins":"2014-06-11T13:45:00.0000000-04:00","ends":"2014-06-11T14:45:00.0000000-04:00","location":"","vimeoId":""},{"id":38,"title":"Project Orleans Overview","abstract":"This talk will do a deep dive into Project Orleans, a runtime and programming model for building distributed systems, based on the actor model.  This technology was used to build the services that power Halo 4.\n\nThis session will go over the basics of the actor model, and the Orleans implementation of it.  It will include an overview of the programming model, and patterns and best practices on how to architect distributed state-full systems using Orleans.","speakers":[{"id":32,"name":"Caitie McCaffrey","twitterHandle":"caitiem20","bio":"Caitie McCaffrey is a Backend Brat, Distributed Systems Diva, and Tech Lover.  She is currently a Software Engineer at HBO, and prior to that worked at 343 Industries.  Her focus is on Web Services, Distributed Systems, and Big Data.  She is passionate about creating fun, social, and collaborative entertainment experiences.\n\nCaitie has a degree in Computer Science from Cornell University, and has worked on several video games including Gears of War 2, Gears of War 3, and most recently Halo 4.  She currently is working at HBO on the HBO Go services.  She maintains a blog at CaitieM.com and frequently discusses technology and entertainment on Twitter @CaitieM20","headshotUrl":"/images/speakers/caitie.jpg"}],"begins":"2014-06-11T13:45:00.0000000-04:00","ends":"2014-06-11T14:45:00.0000000-04:00","location":"","vimeoId":""},{"id":39,"title":"Conversational Objective-C","abstract":"Xamarin's tools shield .NET developers from the joys of writing Objective-C, but if you are going to create iOS applications you should at least know how to read Objective-C. Learning basic principles of this ancient language will make it easier to read documentation, get support, port code, bind libraries, and lead a healthy fulfilling life. This talk will give users an introduction to the language and work through specific examples of binding Objective-C code.","speakers":[{"id":33,"name":"Jackson Harper","twitterHandle":"jacksonh","bio":"Jackson is a former mono developer who now makes a living as a freelance iOS developer. He helped bring you incredibly useful things like Mono's IL Assembler, Moonlight and Managed Windows Forms. Lately he has been making it easier to review your idiot coworkers code with http://codereview.io","headshotUrl":"/images/speakers/jackson.jpg"}],"begins":"2014-06-11T15:00:00.0000000-04:00","ends":"2014-06-11T16:00:00.0000000-04:00","location":"","vimeoId":""},{"id":40,"title":"MonoGame Deep Dive - A Contributors Guide","abstract":"MonoGame is a popular cross platform gaming framework for Windows, Mac, Linux, Android, Ouya, iOS, PSM and PS4. This session will not focus on using MonoGame but on its internals. So if you've ever wanted to contribute/see what goes on 'under the hood' or you want to contribute but just don't know where to start this is the session for you. We will go through how the framework is put together and look into how you go about fixing bugs and implementing new features.","speakers":[{"id":22,"name":"Dean Ellis","twitterHandle":"infspacestudios","bio":"Dean Ellis has been a software engineer for the last 17 years. He is currently a hacker at Xamarin. Prior to working for Xamarin he was the project coordinator for the MonoGame project.","headshotUrl":"/images/speakers/dean.jpg"}],"begins":"2014-06-11T15:00:00.0000000-04:00","ends":"2014-06-11T16:00:00.0000000-04:00","location":"","vimeoId":""}]