[{"id":1,"name":"Paul Betts","twitterHandle":"paulcbetts","bio":"I'm a Windows / .NET Hacker for GitHub who graduated from The Ohio State University. In my spare time, I hack on some open-source software, play guitar and bass, and in general am within ε of really awesome.","headshotUrl":"/images/speakers/paul.jpg"},{"id":2,"name":"Amy Burns","twitterHandle":"timeyoutakeit","bio":"I am a Documentation Developer for Xamarin - in other words I write for both humans and our robot overlords. I am relatively new to the .NET community - I graduated with a CS degree only last summer, and have been working for Xamarin since July last year. I enjoying random hacking, reading and pondering what will become of the world once robots take over.","headshotUrl":"/images/speakers/amy.jpg"},{"id":3,"name":"Jeroen Frijters","twitterHandle":"jeroenfrijters","bio":"Lead developer and founder of IKVM.NET an open source Java VM for .NET. CLR geek and accidental security researcher.","headshotUrl":"/images/speakers/jeroen.jpg"},{"id":4,"name":"James Newton-King","twitterHandle":"jamesnk","bio":"James Newton-King is a software developer from Wellington, New Zealand. He works for Intergen where he spends his time building awesome web applications and making fun of SharePoint.\n\nJames is best known for creating Json.NET, one of .NET's most popular open source libraries with over 5 million downloads and used by Visual Studio, Azure, ASP.NET WebAPI, SignalR, RavenDB and hundreds of other .NET libraries.","headshotUrl":"/images/speakers/james.jpg"},{"id":5,"name":"Jeremy Miller","twitterHandle":"jeremydmiller","bio":"Jeremy is the Director of Software Architecture at Extend Health. Jeremy began his software career writing \"Shadow IT\" applications to automate his engineering documentation, then wandered into software development because it looked like more fun.  Jeremy is the author of StructureMap and the technical leader of the FubuMVC community.","headshotUrl":"/images/speakers/jeremy.jpg"},{"id":6,"name":"Jérémie Laval","twitterHandle":"jeremie_laval","bio":"French guy, Xamarin hacker, I have been in the Mono scene for a long time, working on the various open-source part of the project. These days, I'm working on improving the developer experience for Xamarin.iOS and Xamarin.Android.","headshotUrl":"/images/speakers/jeremie.jpg"},{"id":7,"name":"Greg Shackles","twitterHandle":"gshackles","bio":"Greg Shackles is a Senior Software Engineer at Olo. He is a Xamarin MVP, host of the Gone Mobile podcast, organizer of the NYC Mobile .NET Developers Group, author of Mobile Development with C# and also a monthly Visual Studio Magazine column. Outside of technology, Greg is obsessed with heavy metal, baseball, and craft beer, sometimes in combination, and is also an aspiring homebrewer.","headshotUrl":"/images/speakers/greg.jpg"},{"id":8,"name":"Andreia Gaita","twitterHandle":"sh4na","bio":"Andreia Gaita is a C#/C++ developer and long-time open source and Mono contributor. For the past 16 years she has been involved in the development of cross-platform applications, services and libraries, embedding browser engines, creating bindings and making tools that help developers be successful at companies such as Novell, Xamarin and Unity. She hails from the sunny city of Lisbon, Portugal and currently lives in Copenhagen, working as a freelancer.","headshotUrl":"/images/speakers/andreia_gaita.jpg"},{"id":9,"name":"Joe Mayo","twitterHandle":"joemayo","bio":"Joe Mayo is an author, consultant, and instructor who specializes in Microsoft and Xamarin technologies. He has been using C# since it was first announced in July 2000 and his 6 books are all on .NET topics. For his community contributions, Microsoft has honored Joe with several MVP awards over the years.","headshotUrl":"/images/speakers/joe.jpg"},{"id":10,"name":"Andreas Håkansson","twitterHandle":"thecodejunkie","bio":"Andreas Håkansson is Senior Software Engineer based in Sweden. He is an active participant of the open-source community, both as a contributor and as the creator of projects such as Common Service Factory, MefContrib and Nancy. Andreas can be found tweeting regularly using @TheCodeJunkie.","headshotUrl":"/images/speakers/andreas.jpg"},{"id":11,"name":"Tomasz Janczuk","twitterHandle":"tjanczuk","bio":"I have worked for 12 years at Microsoft, writing .NET Framework code as well as code in .NET Framework. While at Microsoft I have also spent a lot of time working on the Node.js story for Windows and Windows Azure. I have created the https://github.com/tjanczuk/iisnode project for hosting Node.js applications in IIS on Windows which today powers Node.js applications in Windows Azure Web Sites and Windows Azure Mobile Services. In my free time I have played with Node.js and .NET interoperability which resulted in the Edge.js project (http://tjanczuk.github.io/edge/).\n\nAfter Microsoft I spent some time on a startuptical (https://mobilechapters.com). When the startup did what startups do, I took my learnings and joined Hewlett-Packard to help with OpenStack development.\n\nI live in the Pacific Northwest and enjoy every drop of the rain.","headshotUrl":"/images/speakers/tomasz.jpg"},{"id":12,"name":"Anthony van der Hoorn","twitterHandle":"anthony_vdh","bio":"Anthony van der Hoorn is a co–founder of Glimpse, and a regular speaker on such topics as Open Source, Web Practices and Diagnostics for the Web. Anthony has specializing in web and front end development with technologies such as JavaScript, CSS, and HTML. He’s bounced between living and working New York City and his home town of Brisbane, Australia – he’s back in the USA at the moment. Anthony previously worked in the Financial Services sector developing high frequency trading systems and, in his spare time, he can be found out and about taking photos, speaking at conferences, and working on other Open Source projects.","headshotUrl":"/images/speakers/anthony.jpg"},{"id":13,"name":"Dustin Campbell","twitterHandle":"dcampbell","bio":"Dustin Campbell is a principal program manager on the Visual Studio team, where he works on the Visual Basic and C# language service experiences. Currently, he is focused on the future of Visual Basic and C# in the .NET Compiler Platform (\"Roslyn\"). Before joining Microsoft, he developed much of the low-level plumbing of the award-winning CodeRush and Refactor! products at DevExpress. A regular speaker, Dustin is a noted authority in many advanced areas of the Microsoft .NET Framework and dives deep \"under the hood\" of any technology that he works with.\n\nDustin is a programming language nut. His favorite color is blue.","headshotUrl":"/images/speakers/dustin.jpg"},{"id":14,"name":"Daniel Plaisted","twitterHandle":"dsplaisted","bio":"Since joining Microsoft in 2008, Daniel has worked on the Managed Extensibility Framework (MEF), Portable Class Libraries, and the .NET Framework.  He's presented at MS TechEd, Build, and various local groups, code camps, and conferences.  In his free time, he enjoys computer games, reading, hiking, juggling, and footbagging (hackey-sack).","headshotUrl":"/images/speakers/daniel.jpg"},{"id":15,"name":"Itamar Syn-Hershko","twitterHandle":"synhershko","bio":"Itamar is a search technologies, distributed systems and architecture expert.\n\nApache Lucene.NET committer, Elasticsearch savant, and the author of RavenDB in Action, Itamar is a frequent speaker at international conferences and provide on-site training and consultancy services around the world.","headshotUrl":"/images/speakers/itamar.jpg"},{"id":16,"name":"Mahesh Krishnan","twitterHandle":"maheshkrishnan","bio":"Mahesh Krishnan works as a Principal Consultant at Readify in Melbourne, Australia. He is a Windows Azure MVP, has written a couple of books, and speaks regularly at conferences. He is active in the local .NET community in Melbourne, and is constantly organising code camps and other events such as the conference Developer Developer Developer over there.","headshotUrl":"/images/speakers/mahesh.jpg"},{"id":17,"name":"Sean Farmar","twitterHandle":"farmar","bio":"A SOA and NServiceBus expert, Sean Farmar is an independent consultant with over 20 years of experience in software development space.\nSean was the Lead Technical Architect in his last couple of roles, and has hands on experience in designing building and deploying distributed systems using NServiceBus, from inception to production, then scaling out and growing.\n\nCurrently Sean is helping customers succeed in adopting SOA and NServiceBus","headshotUrl":"/images/speakers/sean.jpg"},{"id":18,"name":"Cristian Prieto","twitterHandle":"cprieto","bio":"Cristian is a Senior Consultant working for Readify in Melbourne, Australia. In more than 13 years he has coded in so many different platforms that until now for him is very difficult to even explain to his mom what he do for living. He is a a known speaker in the .NET circles of Melbourne and when he is not learning or playing with code he could be found reading about history and over all, the impact of cats in internet history.","headshotUrl":"/images/speakers/cristian.jpg"},{"id":19,"name":"Yan Cui","twitterHandle":"theburningmonk","bio":"Yan Cui works as a server side developer at Gamesys where he develops scalable backend services for Gamesys's social games on mobile and Facebook. He is a regular speaker, blogger, open source author and co-author of the upcoming book \"F# Deep Dives\" by Mannings.","headshotUrl":"/images/speakers/yan.jpg"},{"id":20,"name":"Ulrich Czekalla","twitterHandle":"uczekalla","bio":"Ulrich Czekalla has been involved with Wine since 1999 when he worked at Corel Corp. as part of the Wine team porting WordPerfect and Corel Draw to Linux. All these years later he continues his involvement with Wine as the Director of Development at CodeWeavers Inc., a company that sells a proprietary version of Wine called CrossOver and provides porting services to the Mac, Linux and Android platforms.","headshotUrl":"/images/speakers/ulrich.jpg"},{"id":21,"name":"Stuart Lodge","twitterHandle":"slodge","bio":"Stuart loves writing code. For the last 20 years, he’s been lucky enough to be paid for it too. In open source, he’s published several projects most recently including a BDD UI test automation suite for WindowsPhone and the MvvmCross application framework for modern C# apps. When not coding, he loves to try and to ski as often as he can.","headshotUrl":"/images/speakers/stuart.jpg"},{"id":22,"name":"Dean Ellis","twitterHandle":"infspacestudios","bio":"Dean Ellis has been a software engineer for the last 17 years. He is currently a hacker at Xamarin. Prior to working for Xamarin he was the project coordinator for the MonoGame project.","headshotUrl":"/images/speakers/dean.jpg"},{"id":23,"name":"Scott Blomquist","twitterHandle":"sblom","bio":"Scott Blomquist is a full-time open source developer at Microsoft. He's currently on the NuGet team, and previously was at Microsoft Open Technologies where he worked on the Node.js core team and also authored Microsoft's first-ever contribution to the Chromium browser project. He loves making disparate technologies play nicely together, and wants to someday live in a treehouse, so long as it has broadband.","headshotUrl":"/images/speakers/scott_blomquist.jpg"},{"id":24,"name":"Chris Eldredge","twitterHandle":"creldredge","bio":"Chris Eldredge is a software developer for The Motley Fool who loves build tools , open source and Guinness.","headshotUrl":"/images/speakers/chris_eldredge.jpg"},{"id":25,"name":"Jonathan Peppers","twitterHandle":"jonathanpeppers","bio":"Jon was the lead developer on the successful C# MonoGame game, Draw a Stickman: EPIC, winner of two Webby awards. The game is currently available on iOS, Android, Kindle, Windows Phone, Windows 8, Mac, and Steam. He is also the author of the book \"Xamarin Cross-platform Development\" and works on cross platform C# business applications as well as games at Hitcents.","headshotUrl":"/images/speakers/jonathan_peppers.jpg"},{"id":26,"name":"Johnny G Halife","twitterHandle":"johnnyhalife","bio":"Chief Architect from Mural.ly, I've worked in a wide-variety of projects. Prior starting with Mural.ly, I was a Partner Architect from a Software Company, and I got to design and build on things like Powershell Web Access for Windows 8 OS, training material and many enterprise projects.\n\nYou can read more about me on my blog http://johnny.io or checkout my projects at http://github.com/johnnyhalife or http://github.com/tactivos\n\n","headshotUrl":"/images/speakers/johnny_halife.jpg"},{"id":27,"name":"Brendan Forster","twitterHandle":"shiftkey","bio":"Brendan is a nomadic software developer working for GitHub. He's a recovering web developer, and is back doing WPF and obsessing over pixels and performance. He's done a bunch of open source work in the past, and always enjoys talking about software over a beer or two.","headshotUrl":"/images/speakers/brendan.jpg"},{"id":28,"name":"Steffen Forkmann","twitterHandle":"sforkmann","bio":"Steffen Forkmann is a F# MVP and works as a Software Developer on large billing systems in Dynamics NAV and therefore has great experience in applying functional concepts to real-world applications. Steffen is a very active part in the F# open source community and works on projects like \"FAKE - F# Make\", NaturalSpec and fsharpx.","headshotUrl":"/images/speakers/steffen.jpg"},{"id":29,"name":"Alexandra Marin","twitterHandle":"xmonodev","bio":"I like kittens, mobile & rock'n'roll.","headshotUrl":"/images/speakers/alexandra.jpg"},{"id":30,"name":"Jay Schmelzer","twitterHandle":"jayschmelzer","bio":"Jay Schmelzer is a Director of Program Management on the Visual Studio Team at Microsoft.  Jay and his team are responsible for the Visual Studio design-time tools and runtime components used to build line of business and cloud applications. That includes the Visual Studio support for building Microsoft Office, Microsoft SharePoint and Windows Azure solutions, Visual Studio LightSwitch, Microsoft's managed languages (VB.NET, C# and F#) as well as the CLR and .NET Framework.","headshotUrl":"/images/speakers/jay.jpg"},{"id":31,"name":"Howard Dierking","twitterHandle":"howard_dierking","bio":"Howard Dierking is a program manager on the Microsoft Azure Frameworks and Tools team where his focus is on ASP.NET, NuGet and Web APIs. Previously, he served as the editor-in-chief of MSDN Magazine, and also ran the developer certification program for Microsoft Learning. He spent 10 years prior to Microsoft as a developer and application architect with a focus on distributed systems.","headshotUrl":"/images/speakers/howard.jpg"},{"id":32,"name":"Caitie McCaffrey","twitterHandle":"caitiem20","bio":"Caitie McCaffrey is a Backend Brat, Distributed Systems Diva, and Tech Lover.  She is currently a Software Engineer at HBO, and prior to that worked at 343 Industries.  Her focus is on Web Services, Distributed Systems, and Big Data.  She is passionate about creating fun, social, and collaborative entertainment experiences.\n\nCaitie has a degree in Computer Science from Cornell University, and has worked on several video games including Gears of War 2, Gears of War 3, and most recently Halo 4.  She currently is working at HBO on the HBO Go services.  She maintains a blog at CaitieM.com and frequently discusses technology and entertainment on Twitter @CaitieM20","headshotUrl":"/images/speakers/caitie.jpg"},{"id":33,"name":"Jackson Harper","twitterHandle":"jacksonh","bio":"Jackson is a former mono developer who now makes a living as a freelance iOS developer. He helped bring you incredibly useful things like Mono's IL Assembler, Moonlight and Managed Windows Forms. Lately he has been making it easier to review your idiot coworkers code with http://codereview.io","headshotUrl":"/images/speakers/jackson.jpg"}]